IdeaRS.Connections
FinPlateData Properties
Compatible with IDEA StatiCa 0.0
The FinPlateData type exposes the following members.
Properties
Name | Description
Anchoring
 Gets or sets the properties of the anchoring
ConnectionType
 Gets or sets the type of connection of two parts.
CreateNotch
 If true notch is generated automatically
Fastening
 Gets or sets the properties of the anchoring
Gap
 Gets or sets the gap of connected member from related member plate.
IsActive |  (Inherited from ConnectionCmdData.)
IsWeld
 If true welds are generated automatically
Member1
 Gets or sets the first connected member
Member1Part
 Gets or sets the plate, through which the beam is connected
MemberFlangesWeld
 Gets or sets the properties of the member weld - flanges
MemberWeld
 Gets or sets the properties of the member weld - other parts
Name
 Gets or set the name
 (Inherited from ConnectionCmdData.)
NotchOffset
 Gets or sets the value for notch offset
OffsetBottom
 Gets or sets the bottom offset of the base plate boundary in the horizontal direction (the width of the plate). The size of the base plate is based on the circumscribed box of the column.
OffsetTop
 Gets or sets the top offset of the base plate boundary in the horizontal direction (the width of the plate). The size of the base plate is based on the circumscribed box of the column.
OperationId
 Gets or sets the identifier of the operation in the manufacturer sequence
 (Inherited from ConnectionCmdData.)
Overlap
 Gets or sets the overlap of fin plate over connected member.
PlateMaterialName
 Gets or sets the name of the material If value is null or empty material is taken from column
 (Inherited from PlateDataBase.)
PlateWeld
 Gets or sets the properties of the plate weld
PositionCode
 Gets or sets the fin plate position. Supported is left, right and both.
RelatedMember
 Gets or sets the related member (other members are connected to this member)
RemainingPart
 Gets or sets the information, whether fin plate is at the begin or at the end of added member.
ShapeData
 Collection of plate editor data
 (Inherited from PlateDataBase.)
Thickness
 Gets or sets the thickness of the plate
 (Inherited from PlateDataBase.)
Top
See Also
Reference
FinPlateData Class
IdeaRS.Connections.Data Namespace